# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [2]:
import pandas as pd
import re
import numpy as np

Next, import `Orders` from the file `Oders.csv` located in the `data` folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [3]:
orders = pd.read_csv(r"..\data\Orders.csv")
orders_v1 = orders.copy()
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [2]:
# your code here

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [59]:
orders_customer_status = orders.groupby(['CustomerID', 'Country']).agg({'amount_spent': 'sum'}).sort_values(by = 'amount_spent', ascending = False)
orders_customer_status

                           amount_spent
CustomerID Country
14646      Netherlands        280206.02
18102      United Kingdom     259657.30
17450      United Kingdom     194550.79
16446      United Kingdom     168472.50
14911      EIRE               143825.06
...                                 ...
17956      United Kingdom         12.75
16454      United Kingdom          6.90
14792      United Kingdom          6.20
16738      United Kingdom          3.75
13256      United Kingdom          0.00

[4347 rows x 1 columns]

In [20]:
orders_v2['amount_spent'].describe()

count      4347.000000
mean       2050.013320
std        8980.103578
min           0.000000
25%         307.430000
50%         671.960000
75%        1661.195000
max      280206.020000
Name: amount_spent, dtype: float64

In [47]:
q_95 = orders_v2['amount_spent'].quantile(q=0.95) #, axis=0, numeric_only=True, interpolation='linear')
q_75 = orders_v2['amount_spent'].quantile(q=0.75)
q_95, q_75

(5774.277999999997, 1661.1950000000002)

In [79]:
#orders_v1['Quantiles'] = ['VIP' if value >= q_95 else 'Preffered Customers' if value >= q_75 & <= q_95 else 'Casual'  for value in orders_v2['amount_spent']]


#correct syntax? --- [f(x) if condition elif condition_2 g(x) else h(x) for x in iterable_object]

def assign_customer(value):
    q_95 == 5774.277
    q_75 == 1661.195
    if value >= q_95:
        return 'VIP'
    elif   q_75 <= value < q_95:
        return 'Preferred Customers'
    else:
        return 'Casual'
            


quant_list = list(map(assign_customer, orders_customer_status['amount_spent']))

orders_customer_status['Quantiles'] = quant_list

orders_customer_status

                           amount_spent Quantiles
CustomerID Country
14646      Netherlands        280206.02       VIP
18102      United Kingdom     259657.30       VIP
17450      United Kingdom     194550.79       VIP
16446      United Kingdom     168472.50       VIP
14911      EIRE               143825.06       VIP
...                                 ...       ...
17956      United Kingdom         12.75    Casual
16454      United Kingdom          6.90    Casual
14792      United Kingdom          6.20    Casual
16738      United Kingdom          3.75    Casual
13256      United Kingdom          0.00    Casual

[4347 rows x 2 columns]

                           amount_spent Quantiles
CustomerID Country
14646      Netherlands        280206.02       VIP
18102      United Kingdom     259657.30       VIP
17450      United Kingdom     194550.79       VIP
16446      United Kingdom     168472.50       VIP
14911      EIRE               143825.06       VIP
...                                 ...       ...
17956      United Kingdom         12.75    Casual
16454      United Kingdom          6.90    Casual
14792      United Kingdom          6.20    Casual
16738      United Kingdom          3.75    Casual
13256      United Kingdom          0.00    Casual

[4347 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [88]:
vip_cust_country = orders_customer_status[(orders_customer_status['Quantiles'] == 'VIP')]

vip_cust_country.value_counts('Country')

Country
United Kingdom     178
Germany             11
France               9
Switzerland          3
Spain                2
Portugal             2
Japan                2
EIRE                 2
Finland              1
Channel Islands      1
Netherlands          1
Norway               1
Singapore            1
Denmark              1
Sweden               1
Cyprus               1
Australia            1
dtype: int64

In [20]:
# your code here

Country
United Kingdom     178
Germany             11
France               9
Switzerland          3
EIRE                 2
Japan                2
Portugal             2
Spain                2
Norway               1
Netherlands          1
Singapore            1
Finland              1
Sweden               1
Denmark              1
Cyprus               1
Channel Islands      1
Australia            1
Name: Quantiles, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [93]:
vip_pref_cust_country = orders_customer_status[(orders_customer_status['Quantiles'] == 'Preferred Customers')] + orders_customer_status[(orders_customer_status['Quantiles'] == 'VIP')]

vip_pref_cust_country.value_counts('Country')

Country
United Kingdom     934
Germany             39
France              29
Belgium             11
Switzerland          9
Spain                7
Portugal             7
Norway               7
Italy                5
Finland              5
Japan                4
Australia            4
Channel Islands      4
EIRE                 3
Denmark              3
Cyprus               3
Sweden               2
Israel               2
Iceland              1
Austria              1
Greece               1
Lebanon              1
Malta                1
Netherlands          1
Poland               1
Singapore            1
Canada               1
dtype: int64

In [21]:
# your code here

Country
United Kingdom     934
Germany             39
France              29
Belgium             11
Switzerland          9
Spain                7
Portugal             7
Norway               7
Italy                5
Finland              5
Channel Islands      4
Australia            4
Japan                4
EIRE                 3
Denmark              3
Cyprus               3
Sweden               2
Israel               2
Lebanon              1
Iceland              1
Greece               1
Malta                1
Netherlands          1
Poland               1
Singapore            1
Canada               1
Austria              1
Name: Quantiles, dtype: int64